Repository: patratiip/procrastinator
Catalog: lib/src/core/constant/localization/l10n/intl_*.arb
Languages: de_de

# anmeldungLogInScreenName
source: Login
de_de: Anmeldung

# passwordTextFieldLabel
source: Password
de_de: Kennwort

# logInButtonName
source: Login
de_de: Anmelden

# forgotPassButtonName
source: Forgot password?
de_de: Kennwort vergessen?

# anmeldungAppBarText
source: Main
de_de: Anmeldung

# statistikAppBarText
source: Statisti—Å
de_de: Statistik

# lectionsPlanAppBarText
source: Lections plan
de_de: Kursplan

# profileAppBarText
source: Profile
de_de: Profil

# entrySuccessfulAddedCalendarMessage
source: Entry was added successfully!
de_de: Eintrag erfolgreich hinzugefügt!

# calendarFormatButton
source: Month
de_de: Monat

# calendarFormatButtonTwoWeeks
source: 2 Weeks
de_de: 2 Wochen

# calendarFormatButtonWeek
source: Week
de_de: Woche

# entryTypeDropdownHintText
source: Choose entry type...
de_de: Anmeldentyp wahlen...

# schoolEntryType
source: School
de_de: Schule

# homeEntryType
source: Home
de_de: Heim

# sickEntryType
source: Sick
de_de: Krank

# looseEntryType
source: Loose
de_de: Fehl

# addEntryButtonText
source: Add entry
de_de: Anmelden

# lastFiveEntriesWidgetHeader
source: Last 5 Entries
de_de: Letzte 5 Anmeldungen

# loosedEntriesWidgetHeader
source: Loosed entries
de_de: Fehlende Anmeldungen

# todayLectionWidgetHeader
source: Today lection
de_de: Heutige Lektion

# noLessonsToday
source: No lections found today
de_de: Heute gibt es keine Unterrichten

# lectionsListWidgetHeader
source: Next lections
de_de: Nächste

# logOutButtonText
source: Log out
de_de: Abmelden

# profileEdit
source: Edit profile
de_de: Profile bearbeiten

source: Sick list
de_de: Krankmeldung

source: Loose report
de_de: Fehlmeldung

source: Documents
de_de: Unterlagen

source: Contacts
de_de: Kontakten

# userNameAndEntriesHeader
source: {userDisplayname} Entries
de_de: {userDisplayname} Anmeldungen

# statisticWidgetNDays
source: {schoolQty} days or
de_de: {schoolQty} Tage oder

source: in School
de_de: im Schule

# atHomeStatisticWidget
source: at Home
de_de: Zuhause

# totalEntiesTotalVisitsDaysStatisticWidget
source: Totally {entiesQty} from {totalVisits} days
de_de: Insgesamt {entiesQty} von {totalVisits} Tage

# deleteEntryDialogHeader
source: Delete entry
de_de: Anmeldung löschen

# deleteEntryShureTextDialog
source: Are you shure that you want to delete this entry?
de_de: Möchtest du echt diese Anmeldung löschen?

# allEntriesAddedSuccessMessage
source: You have done everything!
de_de: Hast du alles geschaft!

# calendarStateErrorMessage_future
source: Attention! Future
de_de: Achtung! Zukunft

# calendarStateErrorMessage_schoolTypeOnlyToday
source: You can only register at the school today
de_de: In der Schule knnst du dich nur Heute anmelden

# calendarStateErrorMessage_thisDateExists
source: Registration with this date already exists
de_de: Anmeldung mit diese Datum schon exestiert

# calendarStateErrorMessage_noLessonsToday
source: No lections this day!
de_de: Keine Unterrichten!

# calendarStateErrorMessage_distanceToSchool
source: You are not at school. Distance {distance} meters
de_de: Du bist nicht in der Schule. Distance {distance} meters

# userTypeLoginError
source: Your user type is Undefined. Try logging out of the application and logging in again. If this does not work, please contact the IT department of Lutz&Grub Academy.
de_de: Ihr Benutzertyp ist Undefiniert. Versuchen Sie, sich von der Anwendung abzumelden und erneut anzumelden. Sollte dies nicht funktionieren, wenden Sie sich bitte an die IT-Abteilung der Lutz&Grub Academy.

# authenticationUserTypeErrorScreeenText
source: Authentication error
de_de: Authentifizierungsfehler

# sickDaysFromPossible
source: Sick {entiesQty} from {possibleLooseDays} days
de_de: Krank {entiesQty} von {possibleLooseDays} Tage

# loosedFromPossibleDays
source: Loosed and sick {loosedQty} from {possibleLooseDays} days
de_de: Fehl und Krank {loosedQty} von {possibleLooseDays} Tage

source: You have no one entry added
de_de: Sie haben keinen einzigen Eintrag hinzugefügt

# groupText
source: Group
de_de: Gruppe

# selectAUserTypeText
source: Select a user type
de_de: Wählen Sie den Benutzertyp

# registrationButtonText
source: Register
de_de: Registrieren

# schoolLocationDropDownText
source: Choose the location of the school
de_de: Wählen Sie den Standort der Schule

# usersAppBarText
source: Users
de_de: Benutzer

# calendarStateErrorMessage_buttonText_youAreForgot
source: Forgot to add an entry?
de_de: Hast du vergessen?
